[
    {
        "id": 1,
        "title": "Medical Assistant",
        "subtitle": "A Retrieval-Augmented Generation (RAG) based Medical Diagnosis Assistant",
        "description": "Designed to provide medical diagnosis suggestions based on patient symptoms, age and gender using a combination of a local vector database (ChromaDB), a local reranking model, and reasoning LLM Gemini model via API.",
        "tags": [
            "Python",
            "LangChain",
            "Gemini API",
            "ChromaDB",
            "FastAPI",
            "Gradio",
            "Docker"
        ],
        "links": {
            "github": "https://github.com/bderdz/med_rag_assistant"
        },
        "iconName": "FaRobot",
        "color": "#3b82f6"
    },
    {
        "id": 2,
        "title": "AI-Powered Lead Automation (n8n)",
        "subtitle": "Flexible AI-powered lead automation for small businesses.",
        "description": "This project automates lead handling from forms and APIs that are usually processed manually and with delays. An n8n workflow uses AI (e.g. Google Gemini) to classify incoming leads and generate personalized response emails in real time. Lead data is stored in Google Sheets, while the team receives instant Telegram notifications. The solution reduces manual work, improves response time, and enhances customer experience.",
        "tags": [
            "n8n",
            "Google Forms",
            "Google Sheets",
            "Gmail API",
            "AI Agent",
            "Telegram Bot",
            "Automation"
        ],
        "links": {
            "case_study": "/projects/case_study_lead.pdf"
        },
        "iconName": "FaHistory",
        "color": "#8b5cf6"
    },
    {
        "id": 3,
        "title": "Pattern Classifier Neural Network",
        "subtitle": "NumPy-only Custom Multilayer Perceptron (MLP)",
        "description": "Built a neural network from scratch to classify 2x2 pixel patterns (solid, diagonal, horizontal, vertical). Implemented ReLU/Softmax activations, He Normal initialization, Cross-Entropy loss, and Early Stopping. Validated performance using Accuracy, Precision, and Confusion Matrix, featuring a custom visualization tool for predictions.",
        "tags": [
            "Machine Learning",
            "NumPy",
            "Python"
        ],
        "links": {
            "github": "https://github.com/bderdz/pattern_classifier_nn"
        },
        "iconName": "FaNetworkWired",
        "color": "#0d9488"
    },
    {
        "id": 4,
        "title": "Portfolio Website",
        "subtitle": "Modern Web Experience",
        "description": "This portfolio website itself! Project was built with React, Vite, and Framer Motion using a “vibe coding” approach — a fast, exploratory workflow that allowed me to experiment with interactive animations, canvas backgrounds, and responsive glassmorphism design.",
        "tags": [
            "React",
            "Framer Motion",
            "Google Antigravity"
        ],
        "links": {
            "github": "https://github.com/bderdz/bderdz.github.io"
        },
        "iconName": "FaLaptopCode",
        "color": "#f43f5e"
    }
]